# Built In Failures Link Failures Cannot Reload Non Rvt File Not Found Property

Source: https://www.revitapidocs.com/2026/d8d48700-3fb1-6f88-73eb-f15bf3ea1a87.htm

---

| Built In Failures Link Failures Cannot Reload Non Rvt File Not Found Property |
| --- |

Cannot Reload Link because file is not found. Link will remain unchanged in the Document.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId CannotReloadNonRvtFileNotFound { get; }
```

```
Public Shared ReadOnly Property CannotReloadNonRvtFileNotFound As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ CannotReloadNonRvtFileNotFound {
	FailureDefinitionId^ get ();
}
```

```
static member CannotReloadNonRvtFileNotFound : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures LinkFailures Class Autodesk.Revit.DB Namespace